<!DOCTYPE html>
<html>
  <head>
  <meta charset="utf-8">
  <meta http-equiv="X-UA-Compatible" content="IE=edge">
  <meta name="viewport" content="width=device-width, initial-scale=1">
  <title>Import by Hash in x64 Assembly - emsea</title>
  <meta name="description" content="random blog">
  <link rel="stylesheet" href="/css/main.css">
  <link rel="canonical" href="/2017/12/04/import-by-hash/">
  <link rel="alternate" type="application/rss+xml" title="emsea" href="/feed.xml">
</head>

  <body>
    <div class="page-content">
      <article class="post" itemscope itemtype="http://schema.org/BlogPosting">
  <header class="post-header">
    <a href="/">Home</a>
    <br><br>
    <h1 class="post-title" itemprop="name headline">Import by Hash in x64 Assembly</h1>
    <p class="post-meta">
      <time datetime="2017-12-04T00:00:00-08:00" itemprop="datePublished">Dec 04, 2017</time>
      

      
  		

  		
  		

  		•	<span class="tags" itemprop="tags">
  				
  				<a href="/tagged#assembly">#assembly</a>
  			<a href="/tagged#windows">#Windows</a>
  			</span>

  	  

    </p>
  </header>
  <div class="post-content" itemprop="articleBody">
    <h2>Introduction</h2>


    <span class="c1">; rbx = return address to kernel32 loader function BaseThreadInitThunk</span>
    <span class="nf">mov</span> <span class="nb">rbx</span><span class="p">,</span> <span class="p">[</span><span class="nb">rsp</span><span class="p">]</span>

    <span class="c1">; Align address to 64k boundary by clearing bottom two bytes</span>
    <span class="c1">; of pointer stored in rbx (0xFFFF = 65535 = 64*1024 - 1)</span>
    <span class="c1">; xoring a register with itself produces 0 and is the idiomatic way</span>
    <span class="c1">; of zeroing a register on x86 processors</span>
    <span class="nf">xor</span> <span class="nb">bx</span><span class="p">,</span> <span class="nb">bx</span>

    <span class="c1">; Go back 1 multiple of 64k to get the base of the kernel32.dll module</span>
    <span class="nf">sub</span> <span class="nb">rbx</span><span class="p">,</span> <span class="nv">.alloc_granularity</span>

    <span class="c1">; ** Don&#39;t worry about these. We&#39;ll come back to them later</span>
    <span class="nf">lea</span> <span class="nb">rbp</span><span class="p">,</span> <span class="p">[</span><span class="nv">__imp_tab_start</span><span class="p">]</span>
    <span class="nf">sub</span> <span class="nb">rsp</span><span class="p">,</span> <span class="mi">8</span><span class="o">*</span><span class="mi">5</span>
</code></pre></div>
<p>There are calling conventions that assembly programmers have to follow when invoking functions provided by APIs and from other DLLs. This greatly affects how you structure your code. However, because we are writing a stub of code which executes before the real meat of the program, we can elide some of the normal conventions that well-structured assembly code usually employs (in the name of size of course). One of our conventions is going to be storing the base address of the current module we&#39;re importing from into <code>rbx</code> to readily be able to turn RVAs into virtual addresses. We will minimize the use of the stack as much as possible.</p>

<h3>Get the export directory</h3>

<p>Now that we have the base address of kernel32.dll in <code>rbx</code>, we need to parse the headers of the DLL in memory to locate the export directory. All PE files immediately begin with the DOS header which is a valid DOS program that normally spits out an error message about the module not being loaded on Windows. To locate the export directory we first need to obtain the RVA of the PE header which is provided by the <code>e_lfanew</code> field in the DOS header structure. The problem is that we aren&#39;t writing our importer in C and don&#39;t have the convenience of a compiler figuring out the offset of that field from the struct definition. We can quickly remedy this by using WinDbg to <strong>d</strong>isplay the <strong>t</strong>ype of the debug symbols representing the DOS header struct <code>IMAGE_DOS_HEADER</code>:</p>
<div class="highlight"><pre><code class="language-text" data-lang="text">&gt; dt _IMAGE_DOS_HEADER
ntdll!_IMAGE_DOS_HEADER
   +0x000 e_magic          : Uint2B
   +0x002 e_cblp           : Uint2B
   +0x004 e_cp             : Uint2B
   +0x006 e_crlc           : Uint2B
   +0x008 e_cparhdr        : Uint2B
   +0x00a e_minalloc       : Uint2B
   +0x00c e_maxalloc       : Uint2B
   +0x00e e_ss             : Uint2B
   +0x010 e_sp             : Uint2B
   +0x012 e_csum           : Uint2B
   +0x014 e_ip             : Uint2B
   +0x016 e_cs             : Uint2B
   +0x018 e_lfarlc         : Uint2B
   +0x01a e_ovno           : Uint2B
   +0x01c e_res            : [4] Uint2B
   +0x024 e_oemid          : Uint2B
   +0x026 e_oeminfo        : Uint2B
   +0x028 e_res2           : [10] Uint2B
   +0x03c e_lfanew         : Int4B
</code></pre></div>
<p>As we can see, the offset of the <code>e_lfanew</code> field is <code>0x3C</code> bytes from the start of <code>IMAGE_DOS_HEADER</code> (and also from the base address of our kernel32 module). Now we can use that to get the RVA of the PE header: </p>
<div class="highlight"><pre><code class="language-nasm" data-lang="nasm"><span class="c1">; Find the export directory given the base address of kernel32.dll in rbx</span>
<span class="nl">find_export_dir:</span>
    <span class="nf">.e_lfanew</span> <span class="err">=</span> <span class="mh">3Ch</span>

    <span class="c1">; eax = the RVA of the PE header. We use eax instead of rax because</span>
    <span class="c1">; e_lfanew is a 4 byte (dword) field in the structure. If rax were used we would</span>
    <span class="c1">; be reading 8 bytes (qword) from the addressing-mode computed pointer. This pointer </span>
    <span class="c1">; size deduction is performed by the assembler to generate the correct opcode</span>
    <span class="nf">mov</span> <span class="nb">eax</span><span class="p">,</span> <span class="p">[</span><span class="nb">rbx</span> <span class="o">+</span> <span class="nv">.e_lfanew</span><span class="p">]</span>
</code></pre></div>
<p>Note that whenever we modify the register-addressed lower 32 bit component of a 64 bit register, the upper 32 bits of the 64 bit register is zero&#39;d out. Thus, even if <code>rax</code> had a bunch of junk in its upper 32 bits moving a value into <code>eax</code> would zero it out making <code>rax</code> hold the same value as <code>eax</code>. This turns out to be extremely useful when pulling dword sized RVAs out of a dereferenced pointer and then adding that RVA to the module base address contained in <code>rbx</code>. Remember: all sizes have to match in valid instructions so you can only add 64 bit values to other 64 bit values, etc.</p>

<p>Now that we have the RVA of the PE header all we have to do is add it to the base address in <code>rbx</code> and we&#39;ll have the virtual address. However, what are we going to do after we have the virtual address of the PE header? First lets examine the PE header (<a href="https://msdn.microsoft.com/en-us/library/windows/desktop/ms680336(v=vs.85).aspx"><code>IMAGE_NT_HEADERS</code></a>) symbols in WinDbg:</p>
<div class="highlight"><pre><code class="language-text" data-lang="text">&gt; dt -r _IMAGE_NT_HEADERS64 ;* The -r switch recursively displays nested structures
ntdll!_IMAGE_NT_HEADERS64
   +0x000 Signature        : Uint4B
   +0x004 FileHeader       : _IMAGE_FILE_HEADER
      +0x000 Machine          : Uint2B
      +0x002 NumberOfSections : Uint2B
      +0x004 TimeDateStamp    : Uint4B
      +0x008 PointerToSymbolTable : Uint4B
      +0x00c NumberOfSymbols  : Uint4B
      +0x010 SizeOfOptionalHeader : Uint2B
      +0x012 Characteristics  : Uint2B
   +0x018 OptionalHeader   : _IMAGE_OPTIONAL_HEADER64
      +0x000 Magic            : Uint2B
      +0x002 MajorLinkerVersion : UChar
      +0x003 MinorLinkerVersion : UChar
      +0x004 SizeOfCode       : Uint4B
      +0x008 SizeOfInitializedData : Uint4B
      +0x00c SizeOfUninitializedData : Uint4B
      +0x010 AddressOfEntryPoint : Uint4B
      +0x014 BaseOfCode       : Uint4B
      +0x018 ImageBase        : Uint8B
      +0x020 SectionAlignment : Uint4B
      +0x024 FileAlignment    : Uint4B
      +0x028 MajorOperatingSystemVersion : Uint2B
      +0x02a MinorOperatingSystemVersion : Uint2B
      +0x02c MajorImageVersion : Uint2B
      +0x02e MinorImageVersion : Uint2B
      +0x030 MajorSubsystemVersion : Uint2B
      +0x032 MinorSubsystemVersion : Uint2B
      +0x034 Win32VersionValue : Uint4B
      +0x038 SizeOfImage      : Uint4B
      +0x03c SizeOfHeaders    : Uint4B
      +0x040 CheckSum         : Uint4B
      +0x044 Subsystem        : Uint2B
      +0x046 DllCharacteristics : Uint2B
      +0x048 SizeOfStackReserve : Uint8B
      +0x050 SizeOfStackCommit : Uint8B
      +0x058 SizeOfHeapReserve : Uint8B
      +0x060 SizeOfHeapCommit : Uint8B
      +0x068 LoaderFlags      : Uint4B
      +0x06c NumberOfRvaAndSizes : Uint4B
      +0x070 DataDirectory    : [16] _IMAGE_DATA_DIRECTORY
         +0x000 VirtualAddress   : Uint4B
         +0x004 Size             : Uint4B
</code></pre></div>
<p>At the bottom of this listing we can see the <code>DataDirectory</code> array field of the <code>OptionalHeader</code>. This contains the various directories of metadata for the DLL. The first data directory contains the export directory which is what we&#39;re looking for. As such, the RVA of the export directory is contained in <code>OptionalHeader.DataDirectory[0].VirtualAddress</code>. Because we want the <code>VirtualAddress</code> (the first element in the <code>IMAGE_DATA_DIRECTORY</code> structure) and the zeroth element of the <code>DataDirectory</code> array, the RVA of the export directory is located an an offset of simply <code>0x70</code> from the base of <code>OptionalHeader</code>. However, we have the RVA of the PE header struct <code>IMAGE_NT_HEADER</code> in <code>rax</code>. If the offset of the <code>OptionalHeader</code> is <code>0x18</code> and the offset from the start of the <code>OptionalHeader</code> to the export directory (zero&#39;th data directory) is <code>0x70</code> then the offset of the export directory from the start of the PE header is <code>0x18 + 0x70 = 0x88</code>. Using this new offset we can obtain the virtual address of the export directory as follows:</p>
<div class="highlight"><pre><code class="language-nasm" data-lang="nasm">    <span class="nf">.data_dir_0</span> <span class="err">=</span> <span class="mh">88h</span>

    <span class="c1">; Before this instruction rax is the RVA of the start of the PE header. By adding it </span>
    <span class="c1">; to rbx we obtain the virtual address of the PE header in our address space. We can </span>
    <span class="c1">; stuff the offset of the export directory into the addressing mode calculation here</span>
    <span class="c1">; as well. This saves a byte it remove the need for an additional add instruction to</span>
    <span class="c1">; add .data_dir_0 to the base of the PE header. eax now contains the RVA of the export </span>
    <span class="c1">; directory</span>
    <span class="nf">mov</span> <span class="nb">eax</span><span class="p">,</span> <span class="p">[</span><span class="nb">rbx</span> <span class="o">+</span> <span class="nb">rax</span> <span class="o">+</span> <span class="nv">.data_dir_0</span><span class="p">]</span>

    <span class="c1">; rax is the RVA to the export directory for kernel32 so we need to make it a real virtual </span>
    <span class="c1">; address to access the export directory structure.</span>
    <span class="nf">add</span> <span class="nb">rax</span><span class="p">,</span> <span class="nb">rbx</span>
</code></pre></div>
<h3>Start reading the export directory</h3>

<p>After the previous snippets have executed <code>rax</code> holds the virtual address of the export directory. Now we have to rip the data out of this structure to perform the main importing process. Let&#39;s take a peek at the export directory struct to find the fields that we need:</p>
<div class="highlight"><pre><code class="language-text" data-lang="text">&gt; dt IMAGE_EXPORT_DIRECTORY
ole32!IMAGE_EXPORT_DIRECTORY
   +0x000 Characteristics  : Uint4B
   +0x004 TimeDateStamp    : Uint4B
   +0x008 MajorVersion     : Uint2B
   +0x00a MinorVersion     : Uint2B
   +0x00c Name             : Uint4B
   +0x010 Base             : Uint4B
   +0x014 NumberOfFunctions : Uint4B
   +0x018 NumberOfNames    : Uint4B
   +0x01c AddressOfFunctions : Uint4B
   +0x020 AddressOfNames   : Uint4B
   +0x024 AddressOfNameOrdinals : Uint4B
</code></pre></div>
<p>The fields of interest are <code>NumberOfNames</code>, <code>AddressOfFunctions</code>, <code>AddressOfNames</code>, and <code>AddressOfNameOrdinals</code>. Let&#39;s examine each of them in detail:</p>

<h4>AddressOfNames</h4>

<p>This is an array of RVAs pointing to zero-terminated ASCII strings of function names. All of the functions that a PE exports by name are going to be in this array. We will be walking through each of these names and computing their hash. This will be compared with the hash that we store in our own import table. The number of name entries in <code>AddressOfNames</code> is held in <code>NumberOfNames</code>. Every index into this array of a particular function name can be used to index into <code>AddressOfNameOrdinals</code> to obtain the <em>name ordinal</em> of the corresponding function.</p>

<h4>AddressOfNameOrdinals</h4>

